2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_TechnischToegang/data/VerAntwMutatieberichtCorrectieAdres-TC01-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5671001</ABONNEMENT>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Abo materiele en formele historie  voor alle groepen</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>05008</brp:code>
    <brp:naam>Correctie adres</brp:naam>
    <brp:categorie>Correctie</brp:categorie>
    <brp:partijCode>036101</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="1">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>900188005</brp:burgerservicenummer>
          <brp:administratienummer>9098517169</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>J</brp:indicatieNamenreeks>
          <brp:geslachtsnaamstam>Brest naar Kempen</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datum>${vandaag(-10,0,0)}</brp:datum>
          <brp:gemeenteCode>1773</brp:gemeenteCode>
          <brp:woonplaatsnaam>Blauwestad</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:code>V</brp:code>
        </brp:geslachtsaanduiding>
        <brp:bijhouding brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>2010-01-01</brp:datumAanvangGeldigheid>
          <brp:partijCode>170201</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:partijCode>034401</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:adressen>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:datumAanvangGeldigheid>2010-01-01</brp:datumAanvangGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>M</brp:redenWijzigingCode>
            <brp:datumAanvangAdreshouding>2010-01-01</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>1234567890123456</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>1234017890123400</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>1702</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>wijk26</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>straatnaam</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>26</brp:huisnummer>
            <brp:postcode>4811BW</brp:postcode>
            <brp:woonplaatsnaam>Breda</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:datumAanvangGeldigheid>2009-01-01</brp:datumAanvangGeldigheid>
            <brp:datumEindeGeldigheid>2010-01-01</brp:datumEindeGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>M</brp:redenWijzigingCode>
            <brp:datumAanvangAdreshouding>2009-01-01</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>1234567890123456</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>1234017890123400</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>1702</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>wijk25</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>straatnaam</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>25</brp:huisnummer>
            <brp:postcode>4811BW</brp:postcode>
            <brp:woonplaatsnaam>Breda</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:datumAanvangGeldigheid>2008-01-01</brp:datumAanvangGeldigheid>
            <brp:datumEindeGeldigheid>2009-01-01</brp:datumEindeGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>M</brp:redenWijzigingCode>
            <brp:datumAanvangAdreshouding>2008-01-01</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>1234017890123450</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>1234017890123456</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>1773</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>wijk15</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>straatnaam</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>15</brp:huisnummer>
            <brp:postcode>4811AW</brp:postcode>
            <brp:woonplaatsnaam>Breda</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:tijdstipVerval>*</brp:tijdstipVerval>
            <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>A</brp:redenWijzigingCode>
            <brp:datumAanvangAdreshouding>${vandaag(0,0,-2)}</brp:datumAanvangAdreshouding>
            <brp:gemeenteCode>0344</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>Vredenburg</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>Vredenburg</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>3</brp:huisnummer>
            <brp:postcode>3511BA</brp:postcode>
            <brp:woonplaatsnaam>Smalle Ee</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
        </brp:adressen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
            <NAAM>Abo materiele en formele historie  voor alle groepen</NAAM>
        </Row>
    </ResultSet>
</Results>